; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	thermograph3 - mode
	infrared2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	image4 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image4)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph0)
	(supports instrument5 image4)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument6 thermograph3)
	(supports instrument6 image4)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image4)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star1)
	(supports instrument10 image4)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
)
(:goal (and
	(pointing satellite0 Planet13)
	(pointing satellite2 Phenomenon6)
	(pointing satellite3 Phenomenon11)
	(have_image Star7 infrared2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Planet10 thermograph3)
	(have_image Phenomenon11 infrared2)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 image4)
	(have_image Phenomenon14 thermograph1)
	(have_image Planet15 image4)
	(have_image Star16 spectrograph0)
	(have_image Phenomenon17 infrared2)
	(have_image Phenomenon18 thermograph1)
	(have_image Phenomenon19 thermograph3)
	(have_image Phenomenon20 thermograph1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 17
2. (calibrate satellite4 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 0 of 17
3. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 17
4. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 17
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 17
6. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 17
7. (turn_to satellite4 phenomenon14 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 17
8. (take_image satellite4 phenomenon14 instrument10 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 1 of 17
9. (turn_to satellite4 phenomenon18 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon18)
   goals met: 1 of 17
10. (take_image satellite4 phenomenon18 instrument10 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 2 of 17
11. (turn_to satellite4 phenomenon20 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon20)
   goals met: 2 of 17
12. (take_image satellite4 phenomenon20 instrument10 thermograph1)
   added: (have_image phenomenon20 thermograph1)
   goals met: 3 of 17
13. (turn_to satellite3 phenomenon11 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 17
14. (turn_to satellite2 phenomenon19 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon19)
   goals met: 4 of 17
15. (take_image satellite2 phenomenon19 instrument6 thermograph3)
   added: (have_image phenomenon19 thermograph3)
   goals met: 5 of 17
16. (turn_to satellite2 phenomenon6 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 phenomenon6)
   goals met: 6 of 17
17. (turn_to satellite1 phenomenon11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 17
18. (turn_to satellite1 star1 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star1)
   goals met: 6 of 17
19. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 6 of 17
20. (turn_to satellite1 phenomenon11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 17
21. (take_image satellite1 phenomenon11 instrument3 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 7 of 17
22. (turn_to satellite1 phenomenon17 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon17)
   goals met: 7 of 17
23. (take_image satellite1 phenomenon17 instrument3 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 8 of 17
24. (turn_to satellite1 phenomenon9 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon9)
   goals met: 8 of 17
25. (take_image satellite1 phenomenon9 instrument3 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 9 of 17
26. (turn_to satellite1 star7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star7)
   goals met: 9 of 17
27. (take_image satellite1 star7 instrument3 infrared2)
   added: (have_image star7 infrared2)
   goals met: 10 of 17
28. (turn_to satellite0 groundstation0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation0)
   goals met: 10 of 17
29. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 10 of 17
30. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 10 of 17
31. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 11 of 17
32. (turn_to satellite0 phenomenon8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon8)
   goals met: 11 of 17
33. (take_image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 12 of 17
34. (turn_to satellite0 planet13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet13)
   goals met: 13 of 17
35. (take_image satellite0 planet13 instrument0 image4)
   added: (have_image planet13 image4)
   goals met: 14 of 17
36. (turn_to satellite4 planet15 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 planet15)
   goals met: 14 of 17
37. (take_image satellite4 planet15 instrument10 image4)
   added: (have_image planet15 image4)
   goals met: 15 of 17
38. (turn_to satellite2 planet10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet10)
   goals met: 14 of 17
39. (take_image satellite2 planet10 instrument6 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 15 of 17
40. (turn_to satellite2 phenomenon6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon6)
   goals met: 16 of 17
41. (turn_to satellite0 star16 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star16)
   goals met: 15 of 17
42. (take_image satellite0 star16 instrument0 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 16 of 17
43. (turn_to satellite0 planet13 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet13)
   goals met: 17 of 17
